Repository: narcosq/geoPulse
Catalog: app/pkg/localization/locales/*/LC_MESSAGES/messages.po
Languages: ky, ru

# errors.not_found
source: Not found
ky: Табылган жок
ru: Не найдено

# errors.internal_error
source: Internal server error
ky: Сервердин ички катасы
ru: Внутренняя ошибка сервера

# errors.validation_failed
source: Validation failed
ky: Текшерүү катасы
ru: Ошибка валидации

# errors.unauthorized
source: Unauthorized
ky: Авторизацияланган эмес
ru: Неавторизован

# errors.forbidden
source: Forbidden
ky: Кирүүгө тыюу салынган
ru: Доступ запрещен

# errors.credit.invalid_principal.user
source: Invalid bank data or credit type. Please contact technical support
ky: Банктын же кредит түрүнүн туура эмес маалыматтары. Техникалык колдоого кайрылыңыз
ru: Неверные данные банка или типа кредита. Обратитесь в тех. поддержку

# errors.credit.invalid_principal.developer
source: Provided principal amount does not match the expected range for bank or credit type
ky: Берилген негизги сумма банк же кредит түрү үчүн күтүлгөн диапазонго дал келбейт
ru: Предоставленная основная сумма не соответствует ожидаемому диапазону для банка или типа кредита

# errors.credit.invalid_product.user
source: Credit product is not available for the selected bank and credit type
ky: Тандалган банк жана насыя тиби үчүн насыя продуктысы жеткиликтүү эмес
ru: Кредитный продукт недоступен для выбранного банка и типа кредита

# errors.credit.invalid_product.developer
source: Credit product or conditions not found for the given bank_type and credit_type
ky: Берилген банк жана насыя тиби үчүн насыя продуктысы же шарттар табылган жок
ru: Кредитный продукт или условия не найдены для указанного банка и типа кредита

# errors.credit.invalid_min_principal.user
source: Credit amount is below the minimum available for this bank
ky: Кредит суммасы бул банк үчүн жеткиликтүү минималдуу суммадан аз
ru: Сумма кредита меньше минимальной доступной для этого банка

# errors.credit.invalid_min_principal.developer
source: Requested amount is less than min down payment allowed for this credit type
ky: Суралган сумма бул кредит түрү үчүн уруксат берилген минималдуу алгачкы төлөмдөн аз
ru: Запрашиваемая сумма меньше минимального первоначального взноса, разрешенного для этого типа кредита

# errors.credit.invalid_max_term.user
source: Credit term exceeds the maximum allowed for this bank
ky: Кредит мөөнөтү бул банк үчүн максималдуу уруксат берилген мөөнөттөн ашып кетти
ru: Срок кредита превышает максимально допустимый для этого банка

# errors.credit.invalid_max_term.developer
source: Requested term in months is greater than max term allowed for this credit type
ky: Суралган мөөнөт бул кредит түрү үчүн уруксат берилген максималдуу мөөнөттөн көп
ru: Запрашиваемый срок в месяцах больше максимального срока, разрешенного для этого типа кредита

# errors.credit.invalid_min_term.user
source: Credit term is below the minimum allowed for this bank
ky: Кредит мөөнөтү бул банк үчүн минималдуу уруксат берилген мөөнөттөн аз
ru: Срок кредита меньше минимально допустимого для этого банка

# errors.credit.invalid_min_term.developer
source: Requested term in months is less than min term allowed for this credit type
ky: Суралган мөөнөт бул кредит түрү үчүн уруксат берилген минималдуу мөөнөттөн аз
ru: Запрашиваемый срок в месяцах меньше минимального срока, разрешенного для этого типа кредита

# errors.credit.condition_not_found.user
source: Credit conditions not found for this bank or credit type
ky: Бул банк же кредит түрү үчүн кредиттик шарттар табылган жок
ru: Кредитные условия не найдены для данного банка или типа кредита

# errors.credit.condition_not_found.developer
source: No matching credit condition found for given parameters (bank, credit type, amount, term)
ky: Берилген параметрлер үчүн ылайыктуу кредиттик шарттар табылган жок (банк, кредит түрү, сумма, мөөнөт)
ru: Не найдено подходящих кредитных условий для заданных параметров (банк, тип кредита, сумма, срок)

# errors.credit.invalid_down_payment.user
source: Down payment is incorrect. Please check the entered amount
ky: Алгачкы төлөм туура эмес. Киргизилген сумманы текшериңиз
ru: Первоначальный взнос некорректен. Проверьте введённую сумму

# errors.credit.invalid_down_payment.developer
source: Down payment is greater than vehicle price or violates bank rules
ky: Алгачкы төлөм унаа баасынан көп же банктын эрежелерин бузат
ru: Первоначальный взнос больше стоимости автомобиля или нарушает правила банка

# api.healthz.title
source: Health Check
ky: Кызматтын абалы
ru: Проверка состояния

# api.healthz.description
source: Comprehensive health check endpoints (DB, Redis, uptime, etc.)
ky: Тиркеменин абалын текшерүүчү эндпоинттер (БД, Redis, uptime ж.б.)
ru: Эндпоинты проверки состояния приложения (БД, Redis, аптайм и др.)

# api.healthz.docstring
source: Health check endpoints for Kubernetes probes and monitoring. Includes: - /healthz — full system check, - /healthz/live — liveness probe, - /healthz/ready — readiness probe, - /healthz/startup — startup probe.
ky: Kubernetes менен интеграция үчүн кызматтын абалын текшерүүчү эндпоинттер. Камтыйт: - /healthz — системанын толук текшерүүсү, - /healthz/live — liveness probe (тирүүбү кызмат), - /healthz/ready — readiness probe (суроолорду кабыл алууга даярбы), - /healthz/startup — startup probe (кызмат ишке кирдиби).
ru: Эндпоинты для проверки состояния приложения и интеграции с Kubernetes. Включает: - /healthz — полная проверка системы, - /healthz/live — liveness probe (жив ли сервис), - /healthz/ready — readiness probe (готовность обрабатывать запросы), - /healthz/startup — startup probe (успешный запуск).
